export const positions = new Float32Array([
  -1, -1,  1, 
   1, -1,  1, 
  -1,  1,  1, 
   1,  1,  1, 
  -1, -1, -1, 
   1, -1, -1, 
  -1,  1, -1, 
   1,  1, -1, 
])

export const uv = new Float32Array([
  0, 0,  
  1, 0,  
  0, 1,  
  1, 1,  
])

// position, uv index
export const puindexs = new Float32Array([
  // 正面
  0, 1, // 0
  1, 3, // 1
  2, 0, // 2
  3, 2, // 3
  // 正确的
  1, 1, // 4
  5, 3, // 5
  3, 0, // 6
  7, 2, // 7
  // 后退
  5, 1, // 8
  4, 3, // 9
  7, 0, // 10
  6, 2, // 11
  // 左边
  4, 1, // 12
  0, 3, // 13
  6, 0, // 14
  2, 2, // 15
  // 顶部
  7, 1, // 16
  6, 3, // 17
  3, 0, // 18
  2, 2, // 19
  // 底部
  1, 1, // 20
  0, 3, // 21
  5, 0, // 22
  4, 2, // 23
])

export const indexs = new Uint16Array([
  0,  1,  2,   2,  1,  3,  // front
  4,  5,  6,   6,  5,  7,  // right
  8,  9, 10,  10,  9, 11,  // back
 12, 13, 14,  14, 13, 15,  // left
 16, 17, 18,  18, 17, 19,  // top
 20, 21, 22,  22, 21, 23,  // bottom
]);